Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

Why Use Pandas?

Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

In [41]:
# Import Pandas
import pandas as pd

In [42]:
# Mounting Google Drive
from google.colab import drive
drive.mount('/gdrive')

Mounted at /gdrive

# Create

In [43]:
# 1.1 Create from a CSV
df = pd.read_csv('./SampleData/employee_2021_08_01.csv')

print(df)

    employee_id first_name     last_name  ...         dob  fte   location
0       1377208     Tushar        NIYOGI  ...  1958-02-20  1.0    Pokhara
1       1672200      Kabir   Jamarkattel  ...  1963-03-18  0.8  Kathmandu
2       1977006  Balgovind       Baidhya  ...  1982-07-13  1.0    Hetauda
3       3974506    Shambhu  Bhattacharya  ...  1990-03-14  1.0    Pokhara
4       4019778   Jitendra     Tripathee  ...  1990-10-10  1.0    Pokhara
5       4024378     Kundan         Dangi  ...  1964-04-22  1.0    Pokhara
6       5001188    Praveen       Bastola  ...  1974-02-11  1.0  Kathmandu
7       5001252     Aadesh          Raut  ...  1988-10-03  0.5    Hetauda
8       5005963     Kripal      Adhikari  ...  1980-02-28  1.0    Hetauda
9       5009770  Swayambhu      Tamarkar  ...  1975-08-13  1.0  Kathmandu
10      5010823       Muni        Bhujel  ...  1985-03-15  0.9    Hetauda
11      5010831      HIMAL       Baruwal  ...  1992-06-07  0.9    Hetauda
12      5010836    Purnima         Hamal  ...  1972-11-24  1.0  Kathmandu
13      5011015      Nanda   Rajkarnikar  ...  1991-05-17  1.0  Kathmandu
14      5011018       Rani       NEOPANE  ...  1983-12-12  1.0  Kathmandu
15      5011060      Sudha      Kansakar  ...  1973-06-06  0.9  Kathmandu
16      5011105    Anushka     Manandhar  ...  1971-06-10  1.0    Hetauda
17      5011110     Lochan         Maske  ...  1992-10-30  1.0  Kathmandu
18      5011147      Amiri       Gyawali  ...  1977-03-02  1.0  Kathmandu
19      5011401   Mahadevi        Khetan  ...  1982-09-25  1.0    Hetauda
20      5011499    Peenkee        Ranjan  ...  1955-10-14  0.9  Kathmandu
21      5011633     Himani       Pokhrel  ...  1967-08-15  1.0    Pokhara
22      5012159     SARUPA         Dolma  ...  1992-11-28  1.0  Kathmandu
23      5012163     Ameeri     Manandhar  ...  1983-08-31  1.0    Pokhara
24      5012165     Ameeta      Barakoti  ...  1961-10-27  0.6    Hetauda
25      5012319    Sukriti       Chataut  ...  1964-05-16  0.9    Pokhara
26      5012329       Maya         Yadav  ...  1994-01-25  1.0  Kathmandu
27      5014147       Rani        Karkee  ...  1956-07-16  1.0    Hetauda
28       507800      Himal       Banjade  ...  1961-09-07  1.0    Pokhara
29       986301      Mayur         Rumba  ...  1968-08-10  1.0    Pokhara

[30 rows x 14 columns]

In [9]:
# 1.2 Create from a Dictionary  
temp_dict = {
  'col1': [1,2,3],
  'col2': [4,5,6],
  'col3': [7,8,9]
}

dict_df = pd.DataFrame.from_dict(temp_dict)

print(dict_df)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

# READ

In [10]:
# 2.1 Show top and bottom rows

top5 = df.head()
top10 = df.head(10)

print('Top 5 Data')
print(top5)

print('Top 10 Data')
print(top10)

Top 5 Data
   employee_id first_name     last_name  ...         dob  fte   location
0      1377208     Tushar        NIYOGI  ...  1958-02-20  1.0    Pokhara
1      1672200      Kabir   Jamarkattel  ...  1963-03-18  0.8  Kathmandu
2      1977006  Balgovind       Baidhya  ...  1982-07-13  1.0    Hetauda
3      3974506    Shambhu  Bhattacharya  ...  1990-03-14  1.0    Pokhara
4      4019778   Jitendra     Tripathee  ...  1990-10-10  1.0    Pokhara

[5 rows x 14 columns]
Top 10 Data
   employee_id first_name     last_name  ...         dob  fte   location
0      1377208     Tushar        NIYOGI  ...  1958-02-20  1.0    Pokhara
1      1672200      Kabir   Jamarkattel  ...  1963-03-18  0.8  Kathmandu
2      1977006  Balgovind       Baidhya  ...  1982-07-13  1.0    Hetauda
3      3974506    Shambhu  Bhattacharya  ...  1990-03-14  1.0    Pokhara
4      4019778   Jitendra     Tripathee  ...  1990-10-10  1.0    Pokhara
5      4024378     Kundan         Dangi  ...  1964-04-22  1.0    Pokhara
6      5001188    Praveen       Bastola  ...  1974-02-11  1.0  Kathmandu
7      5001252     Aadesh          Raut  ...  1988-10-03  0.5    Hetauda
8      5005963     Kripal      Adhikari  ...  1980-02-28  1.0    Hetauda
9      5009770  Swayambhu      Tamarkar  ...  1975-08-13  1.0  Kathmandu

[10 rows x 14 columns]

In [11]:
last5 = df.tail()
last10 = df.tail(10)

print('Bottom 5 Data')
print(last5)

print('Bottom 10 Data')
print(last10)

Bottom 5 Data
    employee_id first_name last_name  ...         dob  fte   location
25      5012319    Sukriti   Chataut  ...  1964-05-16  0.9    Pokhara
26      5012329       Maya     Yadav  ...  1994-01-25  1.0  Kathmandu
27      5014147       Rani    Karkee  ...  1956-07-16  1.0    Hetauda
28       507800      Himal   Banjade  ...  1961-09-07  1.0    Pokhara
29       986301      Mayur     Rumba  ...  1968-08-10  1.0    Pokhara

[5 rows x 14 columns]
Bottom 10 Data
    employee_id first_name  last_name  ...         dob  fte   location
20      5011499    Peenkee     Ranjan  ...  1955-10-14  0.9  Kathmandu
21      5011633     Himani    Pokhrel  ...  1967-08-15  1.0    Pokhara
22      5012159     SARUPA      Dolma  ...  1992-11-28  1.0  Kathmandu
23      5012163     Ameeri  Manandhar  ...  1983-08-31  1.0    Pokhara
24      5012165     Ameeta   Barakoti  ...  1961-10-27  0.6    Hetauda
25      5012319    Sukriti    Chataut  ...  1964-05-16  0.9    Pokhara
26      5012329       Maya      Yadav  ...  1994-01-25  1.0  Kathmandu
27      5014147       Rani     Karkee  ...  1956-07-16  1.0    Hetauda
28       507800      Himal    Banjade  ...  1961-09-07  1.0    Pokhara
29       986301      Mayur      Rumba  ...  1968-08-10  1.0    Pokhara

[10 rows x 14 columns]

In [12]:
# 2.1 Show columns and Data types
columns = df.columns
print(columns)

Index(['employee_id', 'first_name', 'last_name', 'department_id',
       'department_name', 'manager_employee_id', 'employee_role', 'salary',
       'hire_date', 'terminated_date', 'terminated_reason', 'dob', 'fte',
       'location'],
      dtype='object')

In [14]:
data_types = df.dtypes
print(data_types)

employee_id              int64
first_name              object
last_name               object
department_id            int64
department_name         object
manager_employee_id     object
employee_role           object
salary                   int64
hire_date               object
terminated_date         object
terminated_reason       object
dob                     object
fte                    float64
location                object
dtype: object

In [16]:
# 2.3 Summary Statistics
summary = df.describe()
print(summary)

        employee_id  department_id        salary        fte
count  3.000000e+01      30.000000     30.000000  30.000000
mean   4.292204e+06   35534.700000   8026.333333   0.946667
std    1.408896e+06   17718.081606   2882.129605   0.119578
min    5.078000e+05   11151.000000   2793.000000   0.500000
25%    4.268580e+06   18048.000000   5894.000000   0.925000
50%    5.010926e+06   31288.000000   8857.500000   1.000000
75%    5.011474e+06   52837.500000  10340.000000   1.000000
max    5.014147e+06   55050.000000  12138.000000   1.000000

In [17]:
# Including object in summary
object_summary = df.describe(include='object')
print(object_summary)

       first_name  last_name  ...         dob   location
count          30         30  ...          30         30
unique         29         29  ...          30          3
top          Rani  Manandhar  ...  1961-10-27  Kathmandu
freq            2          2  ...           1         12

[4 rows x 10 columns]

In [64]:
# Correlations
rel = df.corr()

print(rel)

               employee_id  department_id  ...  work_hours  is_full_time
employee_id            1.0            NaN  ...         NaN           NaN
department_id          NaN            NaN  ...         NaN           NaN
salary                 1.0            NaN  ...         NaN           NaN
fte                    NaN            NaN  ...         NaN           NaN
work_hours             NaN            NaN  ...         NaN           NaN
is_full_time           NaN            NaN  ...         NaN           NaN

[6 rows x 6 columns]

In [19]:
# 2.4 Filtering Columns
locations = df.location
print(locations)

0       Pokhara
1     Kathmandu
2       Hetauda
3       Pokhara
4       Pokhara
5       Pokhara
6     Kathmandu
7       Hetauda
8       Hetauda
9     Kathmandu
10      Hetauda
11      Hetauda
12    Kathmandu
13    Kathmandu
14    Kathmandu
15    Kathmandu
16      Hetauda
17    Kathmandu
18    Kathmandu
19      Hetauda
20    Kathmandu
21      Pokhara
22    Kathmandu
23      Pokhara
24      Hetauda
25      Pokhara
26    Kathmandu
27      Hetauda
28      Pokhara
29      Pokhara
Name: location, dtype: object

In [ ]:
locations = df['location']

In [20]:
emp_location = df[['employee_id', 'location']]
print(emp_location)

    employee_id   location
0       1377208    Pokhara
1       1672200  Kathmandu
2       1977006    Hetauda
3       3974506    Pokhara
4       4019778    Pokhara
5       4024378    Pokhara
6       5001188  Kathmandu
7       5001252    Hetauda
8       5005963    Hetauda
9       5009770  Kathmandu
10      5010823    Hetauda
11      5010831    Hetauda
12      5010836  Kathmandu
13      5011015  Kathmandu
14      5011018  Kathmandu
15      5011060  Kathmandu
16      5011105    Hetauda
17      5011110  Kathmandu
18      5011147  Kathmandu
19      5011401    Hetauda
20      5011499  Kathmandu
21      5011633    Pokhara
22      5012159  Kathmandu
23      5012163    Pokhara
24      5012165    Hetauda
25      5012319    Pokhara
26      5012329  Kathmandu
27      5014147    Hetauda
28       507800    Pokhara
29       986301    Pokhara

In [22]:
#  Unique 
branch = df['location'].unique()
print(branch)

['Pokhara' 'Kathmandu' 'Hetauda']

In [23]:
department = df.department_id.unique()
print(department)

[54013 31288 51100 18048 55050 51120 11151 31285 53410]

In [24]:
# 2.5 Filtering Rows
pokhara_emp = df[df['location'] == 'Pokhara']
print(pokhara_emp)

    employee_id first_name     last_name  ...         dob  fte location
0       1377208     Tushar        NIYOGI  ...  1958-02-20  1.0  Pokhara
3       3974506    Shambhu  Bhattacharya  ...  1990-03-14  1.0  Pokhara
4       4019778   Jitendra     Tripathee  ...  1990-10-10  1.0  Pokhara
5       4024378     Kundan         Dangi  ...  1964-04-22  1.0  Pokhara
21      5011633     Himani       Pokhrel  ...  1967-08-15  1.0  Pokhara
23      5012163     Ameeri     Manandhar  ...  1983-08-31  1.0  Pokhara
25      5012319    Sukriti       Chataut  ...  1964-05-16  0.9  Pokhara
28       507800      Himal       Banjade  ...  1961-09-07  1.0  Pokhara
29       986301      Mayur         Rumba  ...  1968-08-10  1.0  Pokhara

[9 rows x 14 columns]

In [25]:
pokhara_employee_department54013 = df[(df['location'] == 'Pokhara') & (df['department_id']==54013)]
print(pokhara_employee_department54013)

   employee_id first_name     last_name  ...         dob  fte location
0      1377208     Tushar        NIYOGI  ...  1958-02-20  1.0  Pokhara
3      3974506    Shambhu  Bhattacharya  ...  1990-03-14  1.0  Pokhara

[2 rows x 14 columns]

In [27]:
# Indexing with iloc
print(df.iloc[14])

# to get column 
print(df.iloc[14, 1])
print(df.iloc[14, -1])

# Slicing
print(df.iloc[10:15])

employee_id                            5011018
first_name                                Rani
last_name                              NEOPANE
department_id                            51120
department_name           NFS NCCH - Starbucks
manager_employee_id                    1977006
employee_role          Food Services Associate
salary                                    5601
hire_date                           2016-10-24
terminated_date                     01-01-1700
terminated_reason                          NaN
dob                                 1983-12-12
fte                                          1
location                             Kathmandu
Name: 14, dtype: object
Rani
Kathmandu
    employee_id first_name    last_name  ...         dob  fte   location
10      5010823       Muni       Bhujel  ...  1985-03-15  0.9    Hetauda
11      5010831      HIMAL      Baruwal  ...  1992-06-07  0.9    Hetauda
12      5010836    Purnima        Hamal  ...  1972-11-24  1.0  Kathmandu
13      5011015      Nanda  Rajkarnikar  ...  1991-05-17  1.0  Kathmandu
14      5011018       Rani      NEOPANE  ...  1983-12-12  1.0  Kathmandu

[5 rows x 14 columns]

# Update

In [45]:
# 3.1 Dropping Rows
null_values = df.isnull().sum()
print(null_values)

employee_id             0
first_name              0
last_name               0
department_id           0
department_name         0
manager_employee_id     0
employee_role           0
salary                  0
hire_date               0
terminated_date         0
terminated_reason      28
dob                     0
fte                     0
location                0
dtype: int64

In [52]:
# df.dropna(inplace=True)

In [47]:
print(df)

    employee_id first_name last_name  ...         dob  fte   location
18      5011147      Amiri   Gyawali  ...  1977-03-02  1.0  Kathmandu
28       507800      Himal   Banjade  ...  1961-09-07  1.0    Pokhara

[2 rows x 14 columns]

In [48]:
# 3.2 Dropping columns
df.drop('terminated_date', axis=1)
print(df)

    employee_id first_name last_name  ...         dob  fte   location
18      5011147      Amiri   Gyawali  ...  1977-03-02  1.0  Kathmandu
28       507800      Himal   Banjade  ...  1961-09-07  1.0    Pokhara

[2 rows x 14 columns]

In [49]:
# 3.3 Creating calculated column
df['work_hours'] = df['fte'] * 40
print(df)

    employee_id first_name last_name  ...  fte   location work_hours
18      5011147      Amiri   Gyawali  ...  1.0  Kathmandu       40.0
28       507800      Himal   Banjade  ...  1.0    Pokhara       40.0

[2 rows x 15 columns]

In [50]:
# Updating Value
# df['work_hours'] = '40 Hours'
# df.iloc[0, -1] = 10

In [51]:
# 3.4 Condition based updating
df['is_full_time'] = df['work_hours'].apply(lambda x:  True if x == 40 else False)
print(df)

    employee_id first_name last_name  ...   location work_hours is_full_time
18      5011147      Amiri   Gyawali  ...  Kathmandu       40.0         True
28       507800      Himal   Banjade  ...    Pokhara       40.0         True

[2 rows x 16 columns]

# Cleaning Data
Data cleaning means fixing bad data in your data set.

Bad data could be:

- Empty cells
- Data in wrong format
- Wrong data
- Duplicates

In [55]:
# Empty Cell 
new_df = df.dropna()

print(new_df.to_string())

    employee_id first_name last_name  department_id            department_name manager_employee_id employee_role  salary   hire_date terminated_date terminated_reason         dob  fte   location  work_hours  is_full_time
18      5011147      Amiri   Gyawali          18048  Patient Equipment Service             5001188   Stock Clerk   10905  2016-11-21      03-15-2020  Contract Expired  1977-03-02  1.0  Kathmandu        40.0          True
28       507800      Himal   Banjade          18048  Patient Equipment Service             5001188   Stock Clerk    8903  1995-09-11      08-26-2005   Medical Urgency  1961-09-07  1.0    Pokhara        40.0          True

In [59]:
# Replace NA with value
df.fillna('-', inplace = True)
print(df)

# Replace only for specified column
df['work_hours'].fillna(0, inplace = True)
print(df)

    employee_id first_name last_name  ...   location work_hours is_full_time
18      5011147      Amiri   Gyawali  ...  Kathmandu       40.0         True
28       507800      Himal   Banjade  ...    Pokhara       40.0         True

[2 rows x 16 columns]
    employee_id first_name last_name  ...   location work_hours is_full_time
18      5011147      Amiri   Gyawali  ...  Kathmandu       40.0         True
28       507800      Himal   Banjade  ...    Pokhara       40.0         True

[2 rows x 16 columns]

In [60]:
# Wrong Format
df['terminated_date'] = pd.to_datetime(df['terminated_date'])
print(df)

    employee_id first_name last_name  ...   location work_hours is_full_time
18      5011147      Amiri   Gyawali  ...  Kathmandu       40.0         True
28       507800      Himal   Banjade  ...    Pokhara       40.0         True

[2 rows x 16 columns]

In [61]:
# Duplicates
print(df.duplicated())

18    False
28    False
dtype: bool

In [62]:
# Removing Duplicates
df.drop_duplicates(inplace = True)

# Output

In [35]:
# 4.1 Output to CSV
df.to_csv('output.csv')

In [36]:
# 4.2 Output to JSON
json = df.to_json()
print(json)

{"employee_id":{"18":5011147,"28":507800},"first_name":{"18":"Amiri","28":"Himal"},"last_name":{"18":"Gyawali","28":"Banjade"},"department_id":{"18":18048,"28":18048},"department_name":{"18":"Patient Equipment Service","28":"Patient Equipment Service"},"manager_employee_id":{"18":"5001188","28":"5001188"},"employee_role":{"18":"Stock Clerk","28":"Stock Clerk"},"salary":{"18":10905,"28":8903},"hire_date":{"18":"2016-11-21","28":"1995-09-11"},"terminated_date":{"18":"03-15-2020","28":"08-26-2005"},"terminated_reason":{"18":"Contract Expired","28":"Medical Urgency"},"dob":{"18":"1977-03-02","28":"1961-09-07"},"fte":{"18":1.0,"28":1.0},"location":{"18":"Kathmandu","28":"Pokhara"},"work_hours":{"18":40.0,"28":40.0},"is_full_time":{"18":true,"28":true}}

In [37]:
# 4.3 Output to HTML
html = df.to_html()
print(html)

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>employee_id</th>
      <th>first_name</th>
      <th>last_name</th>
      <th>department_id</th>
      <th>department_name</th>
      <th>manager_employee_id</th>
      <th>employee_role</th>
      <th>salary</th>
      <th>hire_date</th>
      <th>terminated_date</th>
      <th>terminated_reason</th>
      <th>dob</th>
      <th>fte</th>
      <th>location</th>
      <th>work_hours</th>
      <th>is_full_time</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>18</th>
      <td>5011147</td>
      <td>Amiri</td>
      <td>Gyawali</td>
      <td>18048</td>
      <td>Patient Equipment Service</td>
      <td>5001188</td>
      <td>Stock Clerk</td>
      <td>10905</td>
      <td>2016-11-21</td>
      <td>03-15-2020</td>
      <td>Contract Expired</td>
      <td>1977-03-02</td>
      <td>1.0</td>
      <td>Kathmandu</td>
      <td>40.0</td>
      <td>True</td>
    </tr>
    <tr>
      <th>28</th>
      <td>507800</td>
      <td>Himal</td>
      <td>Banjade</td>
      <td>18048</td>
      <td>Patient Equipment Service</td>
      <td>5001188</td>
      <td>Stock Clerk</td>
      <td>8903</td>
      <td>1995-09-11</td>
      <td>08-26-2005</td>
      <td>Medical Urgency</td>
      <td>1961-09-07</td>
      <td>1.0</td>
      <td>Pokhara</td>
      <td>40.0</td>
      <td>True</td>
    </tr>
  </tbody>
</table>

# Delete

In [38]:
# Delete a DataFrame
del df

In [39]:
print(df)

NameError: ignored